Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/svd/PIC32CX2051MTC128.svd
                        <name>P23</name>
                        <description>I/O Security Status</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P23Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P24</name>
                        <description>I/O Security Status</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P24Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P25</name>
                        <description>I/O Security Status</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P25Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P26</name>
                        <description>I/O Security Status</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P26Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P27</name>
                        <description>I/O Security Status</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P27Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P28</name>
                        <description>I/O Security Status</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P28Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P29</name>
                        <description>I/O Security Status</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P29Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P30</name>
                        <description>I/O Security Status</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P30Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>P31</name>
                        <description>I/O Security Status</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>P31Select</name>
                           <enumeratedValue>
                              <name>PRIVILEGED_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in Privileged-Access mode.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USER_ACCESS</name>
                              <description>The I/O line of the I/O group 0 is in User-Access mode.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>P_IOFR</name>
                  <description>PIO Privilege I/O Freeze Configuration Register (p_iogroup = 0)</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>FPHY</name>
                        <description>Freeze Physical Configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FINT</name>
                        <description>Freeze Interrupt Configuration</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRZKEY</name>
                        <description>Freeze Key</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>24</bitWidth>
                        <enumeratedValues>
                           <name>FRZKEYSelect</name>
                           <enumeratedValue>
                              <name>PASSWD</name>
                              <description>Writing any other value in this field aborts the write operation of the WPEN bit.</description>
                              <value>0x494F46</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>P_SCDR</name>
               <description>PIO Privilege Slow Clock Divider Debouncing Register</description>
               <addressOffset>0x1500</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Slow Clock Divider Selection for Debouncing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>P_WPMR</name>
               <description>PIO Privilege Write Protection Mode Register</description>
               <addressOffset>0x15E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of WPEN. Always reads as 0.</description>
                           <value>0x50494F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>P_WPSR</name>
               <description>PIO Privilege Write Protection Status Register</description>
               <addressOffset>0x15E4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
